## 🔹 PASO 1: Planificación de VLANs y Direccionamiento

## 🖥️ Tabla de Configuración de Dispositivos por VLAN


|Dispositivo|VLAN|Nombre VLAN   |Configuración IP (Formato CLI)             |
|-----------|----|--------------|-------------------------------------------|
|PC_01      |10  |Usuarios      |`ip 192.168.10.10 255.255.255.0 192.168.10.1`|
|PC_02      |10  |Usuarios      |`ip 192.168.10.11 255.255.255.0 192.168.10.1`|
|PC_03      |20  |Administración|`ip 192.168.20.10 255.255.255.0 192.168.20.1`|
|PC_04      |30  |Servidores    |`ip 192.168.30.10 255.255.255.0 192.168.30.1`|

## 🔹 PASO 2: Configuración de Dispositivos

### 1. Edge_01 (Router hacia Internet)

    Router> enable
    Router# configure terminal
    Router(config)# hostname Edge_01
    Edge_01(config)#
    
    ! Configurar interfaz hacia Internet
    Edge_01(config)# interface GigabitEthernet0/0
    Edge_01(config-if)# ip address dhcp
    Edge_01(config-if)# no shutdown
    Edge_01(config-if)# exit
    
    ! Configurar interfaz hacia R_Dist_01
    Edge_01(config)# interface GigabitEthernet0/1
    Edge_01(config-if)# ip address 192.168.100.1 255.255.255.252
    Edge_01(config-if)# no shutdown
    Edge_01(config-if)# exit
    
    ! Ruta estática hacia Internet (si no se obtiene por DHCP)
    Edge_01(config)# ip route 0.0.0.0 0.0.0.0 GigabitEthernet0/0
    
    ! Rutas hacia redes internas
    Edge_01(config)# ip route 192.168.10.0 255.255.255.0 192.168.100.2
    Edge_01(config)# ip route 192.168.20.0 255.255.255.0 192.168.100.2
    Edge_01(config)# ip route 192.168.30.0 255.255.255.0 192.168.100.2
    
    Edge_01(config)# ip name-server 8.8.8.8 8.8.4.4
    Edge_01(config)# ip domain-lookup

    Edge_01(config)# end
    Edge_01# write memory
    Edge_01# show ip interface brief
    Edge_01# show ip route

### 2. R_Dist_01 (Router L3 - Router-on-a-Stick)

    Router> enable
    Router# configure terminal
    Router(config)# hostname R_Dist_01
    R_Dist_01(config)# ip routing
    
    ! Configurar interfaz troncal hacia Sw_02
    R_Dist_01(config)# interface GigabitEthernet0/0
    R_Dist_01(config-if)# no shutdown
    R_Dist_01(config-if)# exit
    
    ! Configurar subinterfaces para VLAN 10
    R_Dist_01(config)# interface GigabitEthernet0/0.10
    R_Dist_01(config-subif)# encapsulation dot1Q 10
    R_Dist_01(config-subif)# ip address 192.168.10.1 255.255.255.0
    R_Dist_01(config-subif)# no shutdown
    R_Dist_01(config-subif)# exit
    
    ! Configurar subinterfaces para VLAN 20
    R_Dist_01(config)# interface GigabitEthernet0/0.20
    R_Dist_01(config-subif)# encapsulation dot1Q 20
    R_Dist_01(config-subif)# ip address 192.168.20.1 255.255.255.0
    R_Dist_01(config-subif)# no shutdown
    R_Dist_01(config-subif)# exit
    
    ! Configurar subinterfaces para VLAN 30
    R_Dist_01(config)# interface GigabitEthernet0/0.30
    R_Dist_01(config-subif)# encapsulation dot1Q 30
    R_Dist_01(config-subif)# ip address 192.168.30.1 255.255.255.0
    R_Dist_01(config-subif)# no shutdown
    R_Dist_01(config-subif)# exit
    
    ! Configurar enlace hacia Edge_01
    R_Dist_01(config)# interface GigabitEthernet0/1
    R_Dist_01(config-if)# ip address 192.168.100.2 255.255.255.252
    R_Dist_01(config-if)# no shutdown
    R_Dist_01(config-if)# exit
    
    ! Ruta por defecto hacia Edge_01
    R_Dist_01(config)# ip route 0.0.0.0 0.0.0.0 192.168.100.1

    ! Usa DNS públicos de Google
    R_Dist_01(config)# ip name-server 8.8.8.8 8.8.4.4 
    R_Dist_01(config)# ip domain-lookup 
    
    R_Dist_01(config)# end
    R_Dist_01# write memory
    R_Dist_01# show ip interface brief
    R_Dist_01# show ip route

## 🔹 PASO 3: Configuración del Switche

### 1. Sw_02 (Switch de Acceso)

    Switch> enable
    Switch# configure terminal
    Switch(config)# hostname Sw_02
    
    ! Crear VLANs
    Sw_02(config)# vlan 10
    Sw_02(config-vlan)# name Usuarios
    Sw_02(config-vlan)# exit
    Sw_02(config)# vlan 20
    Sw_02(config-vlan)# name Administracion
    Sw_02(config-vlan)# exit
    Sw_02(config)# vlan 30
    Sw_02(config-vlan)# name Servidores
    Sw_02(config-vlan)# exit
    
   ! Puerto para PC_01 (VLAN 10)
Sw_02(config)# interface GigabitEthernet1/0
Sw_02(config-if)# switchport mode access
Sw_02(config-if)# switchport access vlan 10
Sw_02(config-if)# spanning-tree portfast edge
Sw_02(config-if)# exit

! Puerto para PC_02 (VLAN 10)
Sw_02(config)# interface GigabitEthernet1/1
Sw_02(config-if)# switchport mode access
Sw_02(config-if)# switchport access vlan 10
Sw_02(config-if)# spanning-tree portfast edge
Sw_02(config-if)# exit

! Puerto para PC_03 (VLAN 20)
Sw_02(config)# interface GigabitEthernet1/2
Sw_02(config-if)# switchport mode access
Sw_02(config-if)# switchport access vlan 20
Sw_02(config-if)# spanning-tree portfast edge
Sw_02(config-if)# exit

! Puerto para PC_04 (VLAN 30)
Sw_02(config)# interface GigabitEthernet1/3
Sw_02(config-if)# switchport mode access
Sw_02(config-if)# switchport access vlan 30
Sw_02(config-if)# spanning-tree portfast edge
Sw_02(config-if)# exit

!Esta es la interfaz conectada a R_Dist_01
Sw_02(config)# interface GigabitEthernet0/0
Sw_02(config-if)# switchport trunk encapsulation dot1q
Sw_02(config-if)# switchport mode trunk
Sw_02(config-if)# switchport trunk allowed vlan 10,20,30
Sw_02(config-if)# no shutdown
Sw_02(config-if)# exit

Sw_02(config)# interface range GigabitEthernet1/0-3
Sw_02(config-if-range)# switchport port-security
Sw_02(config-if-range)# switchport port-security maximum 1
Sw_02(config-if-range)# switchport port-security violation shutdown
Sw_02(config-if-range)# exit

Sw_02(config)# spanning-tree mode rapid-pvst
Sw_02(config)# spanning-tree vlan 1,10,20,30 priority 32768 


    
    Sw_02(config)# end
    Sw_02# write memory
    Sw_02# show vlan brief
    Sw_02# show interface trunk
    Sw_02# show spanning-tree summary

## 🔹 PASO 4: Configuración de PCs


    PC_01> ip 192.168.10.10 255.255.255.0 192.168.10.1 8.8.8.8
    PC_02: ip 192.168.10.11 255.255.255.0 192.168.10.1 8.8.8.8
    PC_03: ip 192.168.20.10 255.255.255.0 192.168.20.1 8.8.8.8
    PC_04: ip 192.168.30.10 255.255.255.0 192.168.30.1 8.8.8.8

## 🔹 PASO 5: Verificación y Troubleshooting

### Comandos útiles para verificación:


    ! En routers:
    show ip interface brief
    show ip route
    show interfaces trunk
    show vlan

    ! En switches:
    show vlan brief
    show interfaces trunk
    show spanning-tree summary
    show mac address-table

    ! Pruebas de conectividad desde PCs:
    ping 192.168.10.1    (Verificar gateway VLAN 10)
    ping 192.168.20.1    (Verificar gateway VLAN 20)
    ping 192.168.30.1    (Verificar gateway VLAN 30)
    ping 192.168.100.1   (Verificar conectividad con Edge_01)
    ping 8.8.8.8        (Verificar conectividad a Internet)

